package com.study.chapter02

/*
128:Int类型，占据4字节，32位
源码：0000 0000 0000 0000 0000 0000 1000 0000
补码：0000 0000 0000 0000 0000 0000 1000 0000

截取最后一个字节，Byte
得到补码：1000 0000
得到原码：1000 0000（-128）
表示最大负数负：128

130：
源码：0000 0000 0000 0000 0000 0000 1000 0010
补码：0000 0000 0000 0000 0000 0000 1000 0010

截取byte：
得到补码：1000 0010
转为原码：0111 1101 + 1 = 1111 1110 = -126
 */
object Test09_Problem_DataTypeConversion {
  def main(args: Array[String]): Unit = {
    val n: Int = 128
    val b: Byte = n.toByte
    println(b)
  }

}
